import styles from "../../styles.module.css";

export default function LastPage() {
  return (
    <div
      style={{
        display: "flex",
        flexDirection: "column",
        height: "100%",
        rowGap: "3px",
      }}
    >
      <h1 className={styles.date}>2024년 6월 4일</h1>
      <div
        style={{
          flex: 1,
          width: "100%",
          textAlign: "center",
          paddingTop: "20px",
          lineHeight: "20px",
        }}
      >
        오늘은 우리의 1주년!
        <br />
        음.. 1주년이니까 뭔가 특별한 걸 꼭 해주고 싶었어
        <br />
        내가 지금 당장 할 수 있는 최대한의 능력을 발휘해서
        <br />
        이 사이트를 만들어봤어!
        <br />
        빽다방에서도 만들고 차경에서도 만들고 집에서도 잠깐잠깐씩 만들었다...!
        <br />
        급하게 만든거라 오류도 있을 수도 있고.. <br />
        사실 더 꾸미고 이것저것 더 추가하고 싶었지만 그렇지는 못했어..ㅜㅜ
        <br />
        그래도 생일 선물로는 책같은 걸 만들어줬으니깐
        <br />
        이번에는 우리 둘만의 사이트야! 어때어때?!
        <br />
        우리 둘만의 비밀번호가 없으면 들어갈 수도 없다구 ㅎㅎ
        <br />
        내 갤러리에 있는 사진들을 우리 사귀기 시작할 때부터 지금까지!
        <br />
        우리 추억들을 되살릴 만한 사진들에 코멘트를 하나씩 달아봤어
        <br />
        사진이 생각보다 진짜 많아서 이것도 넣고 싶고 저것도 넣고 싶고 하다보면
        <br />
        오늘까지 절대로 완성하지 못할 것 같지 뭐야
        <br />
        그래도 최대한 사진 많이 넣으려고 했어!
        <br />
        사진에 코멘트를 하나씩 달면서 느낀 건데
        <br />
        현서랑 함께하면서 내가 처음해본 것들이 진짜 진짜 많더라구!
        <br />
        그리고 하나같이 다 재밌고 행복했던 기억들이 완 ~전 많았어!
        <br />
        난 현서를 만나서 엄청 행복한 사람이 된 것 같아!
        <br />
        인생에 즐겁고 재밌는 일들이 정말정말 많아졌어!
        <br />
        앞으로도 언제까지나 오래오래 즐겁고 재밌는 추억 많이 만들어 나가자!
        <br />
        사랑해 현서야❤️
      </div>
    </div>
  );
}
